---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PolymeshFacet Properties
PolymeshFacet Class See Also Send Feedback
---

The PolymeshFacet type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | V1 | The first vertex of the facet |
|  | V2 | The second vertex of the facet |
|  | V3 | The third vertex of the facet |

# See Also

PolymeshFacet Class

Autodesk.Revit.DB Namespace